title: Startup Folder Persistence
id: b1b2c3d4-3333-5555-bbbb-333333333333
status: stable
description: |
    Detects file creation in Windows Startup folders for persistence.
    Attackers drop malicious executables, scripts, or shortcuts in
    startup folders to execute payloads on user logon or system boot.
references:
    - https://attack.mitre.org/techniques/T1547/001/
    - https://www.elastic.co/guide/en/security/current/startup-folder-persistence.html
author: Defensive Toolkit
date: 2025-11-26
modified: 2025-11-26
tags:
    - attack.persistence
    - attack.t1547.001
    - detection.emerging_threats
logsource:
    category: file_event
    product: windows
detection:
    selection_user_startup:
        TargetFilename|contains:
            - '\AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup\'
            - '\Start Menu\Programs\Startup\'
    selection_system_startup:
        TargetFilename|contains:
            - '\ProgramData\Microsoft\Windows\Start Menu\Programs\Startup\'
            - 'C:\ProgramData\Microsoft\Windows\Start Menu\Programs\StartUp\'
    selection_extensions:
        TargetFilename|endswith:
            - '.exe'
            - '.dll'
            - '.bat'
            - '.cmd'
            - '.vbs'
            - '.vbe'
            - '.js'
            - '.jse'
            - '.wsf'
            - '.wsh'
            - '.ps1'
            - '.lnk'
            - '.hta'
            - '.scr'
    filter_legitimate:
        Image|startswith:
            - 'C:\Program Files\'
            - 'C:\Program Files (x86)\'
            - 'C:\Windows\'
    condition: (selection_user_startup or selection_system_startup) and selection_extensions and not filter_legitimate
falsepositives:
    - Legitimate software installation adding startup entries
    - User-created startup shortcuts
level: medium
